ab-test-result.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            59522

Document Path:          /shorten
Document Length:        46 bytes

Concurrency Level:      10
Time taken for tests:   5.550 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      211000 bytes
Total body sent:        403000
HTML transferred:       46000 bytes
Requests per second:    180.19 [#/sec] (mean)
Time per request:       55.496 [ms] (mean)
Time per request:       5.550 [ms] (mean, across all concurrent requests)
Transfer rate:          37.13 [Kbytes/sec] received
                        70.92 kb/s sent
                        108.05 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    43   55  16.3     48      91
Waiting:        2   48  22.2     47      91
Total:         44   55  16.3     49      92

Percentage of the requests served within a certain time (ms)
  50%     49
  66%     49
  75%     50
  80%     52
  90%     89
  95%     90
  98%     90
  99%     91
 100%     92 (longest request)